# course_descriptions.py

# Опис курсу з основ програмування
COURSE_PROGRAMMING_BASICS = {
    "name": "Основи програмування 💻",
    "description": "Цей курс навчить вас <b>базовим концепціям програмування</b>. Ми вивчимо <b>змінні</b>, <b>цикли</b>, <b>умовні оператори</b> та <b>функції</b>.",
    "topics": [
        "<b>🔢 Змінні та типи даних</b>",
        "<b>🔁 Цикли та умовні оператори</b>",
        "<b>🔧 Функції та модулі</b>",
        "<b>📐 Алгоритми та їх реалізація</b>"
    ],
    "image_url": "https://www.freecodecamp.org/news/content/images/2022/12/main-image.png"
}

# Опис курсу з основ Python 🐍
COURSE_PYTHON_BASICS = {
    "name": "Основи Python 🐍",
    "description": "Цей курс допоможе вам зрозуміти основи мови програмування <b>Python</b>. Ми покриємо базові теми та попрактикуємось у написанні коду.",
    "topics": [
        "<b>📊 Змінні та типи даних у Python</b>",
        "<b>🌀 Цикли та умовні оператори</b>",
        "<b>🛠️ Функції та їх використання</b>",
        "<b>📚 Модулі та бібліотеки Python</b>"
    ],
    "image_url": "https://cloud4box.com/wp-content/uploads/python.jpg"
}


courses = {
    1: ("Основи програмування 💻", "1002483731461"),
    2: ("Основи Python 🐍", "1002483731461")
}